import type { Partner } from "../ui/PartnerCarousel";

export const generalPartners: Partner[] = [
  {
    name: "Российские Студенческие Отряды (РСО)",
    image: "/partners/rso.jpg",
    badges: ["Молодёжь", "Образование", "Патриотизм"],
    benefits: [
      "мотивация молодежи",
      "патриотическое воспитание",
      "развитие потенциала",
      "трудоустройство студентов",
      "формирование кадрового резерва",
    ],
  },
  {
    name: "СтройКорпус",
    image: "/partners/noimage.webp",
    badges: ["Строительство", "Инженерия", "Новостройки"],
    benefits: [
      "качественная отделка",
      "надёжные материалы",
      "опытные специалисты",
      "сжатые сроки",
      "гарантия качества",
    ],
  },
];
